def stalin_sort(arr:list) -> list:
    n = len(arr)
    return [min(arr)] * n    

print(stalin_sort([3, 1, 4, 2, 5]))  # Output: [1, 1, 1, 1, 1]



# крутим относительно "3" 
[2, 4, 5, 6, 3, 1] -> [2, 3, 1] [4, 5, 6] -> [1, 2, 3] [4, 5, 6] -> [1, 2, 3, 4, 5, 6]
# крутим относительно "4" 
[2, 4, 5, 6, 3, 1] -> [2, 4, 3, 1] [5, 6] -> "2" [2, 1] [4, 3] "5" [5, 6] -> [1, 2] [3, 4] [5, 6] -> [1, 2, 3, 4, 5, 6]
import random
arr = [2, 4, 5, 6, 3, 1]
a = random.choice(arr)

[2, 4, 5, 6, 3, 1] -> [2, 4, 5] [6, 3, 1] -> [2] [4, 5] [6] [3, 1] -> [2] [4] [5] ||| [6] [1] [3] -> [2, 4] [5] ||| [1, 6] [3] -> [2, 4, 5] [1, 3, 6] -> [1, 2, 3, 4, 5, 6]


start = 1
finish = 6
cnts = [1, 1, 1, 1, 1, 1]
[1, 2, 3, ...]

[1, 1, 1, 2, 1, 1, 1, 1]
cnts = [7, 1]


2, 4, 5, 6, 3, 1
0, 1, 2, 3, 4, 5



cnt = 0 
[i 2, 4, 5] [i 1, 3, 6] -> [1]
cnt += len arr_1 - i = 3 - 0 = 3
[2,i 4, 5] [1, i 3, 6] -> [1, 2]
[2,i 4, 5] [1, i 3, 6] -> [1, 2, 3]
cnt += len arr_1 - i = 3 - 1 = 2
[2,i 4, 5] [1, 3, i 6] -> [1, 2, 3, 4]
[2, 4, i 5] [1, 3, i 6] -> [1, 2, 3, 4, 5]
[2, 4, 5 i] [1, 3, 6 i] -> [1, 2, 3, 4, 5, 6]

import random

def bogo_sort(arr:list) -> list:
    
    def is_sorted(arr:list) -> bool:
        n = len(arr)
        for i in range(1, n):
            if arr[i] < arr[i - 1]:
                return False
        return True
    
    while not is_sorted(arr):
        random.shuffle(arr)
    
    return arr
[2, 4, 5, 6, 3, 1] -> [5, 3, 4, 1, 2, 6] -> [4, 2, 6, 3, 1, 5] -> ... -> [1, 2, 3, 4, 5, 6]